driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationTwoPropJBI/test/EvntHandler_Pick_InitNo/Input2.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://xml.netbeans.org/schema/EvntHandler_Pick_InitNo/src/Message">
  <soapenv:Body>
    <mes:EventMessage>
      <mes:Content>OnEvent Message.</mes:Content>
      <mes:Set1>
        <mes:Id1>131</mes:Id1>
        <mes:Id2>232</mes:Id2>
      </mes:Set1>
      <mes:Set2>
        <mes:Id1>333</mes:Id1>
        <mes:Id2>434</mes:Id2>
      </mes:Set2>
    </mes:EventMessage>
  </soapenv:Body>
</soapenv:Envelope>