driver-tests/bpelse/dynamicpartnerlink/correlation/CorrelationTwoPropJBI/test/EvntHandler_Pick_InitNo/Input3.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://xml.netbeans.org/schema/EvntHandler_Pick_InitNo/src/Message">
  <soapenv:Body>
    <mes:CorrMessage>
      <mes:Content>Pick Message.</mes:Content>
      <mes:Id1>333</mes:Id1>
      <mes:Id2>434</mes:Id2>
    </mes:CorrMessage>
  </soapenv:Body>
</soapenv:Envelope>